export const state = {

  // 保存当前用户登录状态信息
  username: '',

  // 当前影片详情
  movieDetailDatas: '',

  // 影片放映影厅号
  room: Math.ceil(Math.random() * 10),

  // 影院座位  0: 未售, 1: 已售, 2: 当前选择
  seats: [
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
  ],

  // 保存当前所选座位
  seatSelected: [],

  loading: false

}
